public class A {
    {
        System.out.println("logic (1) id= " + this.id);
        // В этот момент id еще не инициализировано (значение 0)
    }

    static {
        System.out.println("static logic");
        // Выполняется перед при загрузке класса
    }

    private int id = 1;
    // Инициализация поля происходит ПОСЛЕ первого блока,
    // но перед вторым блоком

    public A(int id) {
        this.id = id; // Перезаписываем значение на 100
        System.out.println("ctor id= " + id);
        // Конструктор выполняется после всех логических блоков
    }

    {
        System.out.println("logic (2) id= " + id);
        // Здесь id уже равно 1 (из инициализации поля)
    }
}

public class Main {
    public static void main(String[] args) {
        new A(100);
        // При создании объекта:
        // 1. Загрузка класса 
        // 2. Выделение памяти
        // 3. Инициализация полей значениями по умолчанию 
        // 4. Выполнение логических блоков в порядке объявления
        // 5. Выполнение конструктора
    }
}
